app/controllers/tweets_controller.rb

SELECT  `tweets`.* FROM `tweets`  ORDER BY id DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
---
def index

 @tweets = Tweet.all.order("id DESC").page(params[:page]).per(5)

INSERT INTO `tweets` (`name`, `image`, `text`, `created_at`, `updated_at`) VALUES ('', '', '', '2017-05-15 05:19:21', '2017-05-15 05:19:21')
---
def create


Tweet.create(tweet_params)